asciidoc/listings/vol3-clause-biceps-content-example-report-sequence.xml

<?xml version="1.0" encoding="UTF-8"?>
<s12:Envelope
        xmlns:s12="http://www.w3.org/2003/05/soap-envelope"
        xmlns:msg="http://standards.ieee.org/downloads/11073/11073-10207-2017/message"
        xmlns:wsa="http://www.w3.org/2005/08/addressing"
        xmlns:sdpi="urn:oid:1.3.6.1.4.1.19376.1.6.2.10.1.1.1">
    <s12:Header>
        <wsa:Action>http://standards.ieee.org/downloads/11073/11073-20701-2018/StateEventService/EpisodicMetricReport</wsa:Action>
        <wsa:MessageID><!-- ... --></wsa:MessageID>
        <wsa:To><!-- ... --></wsa:To>
        <sdpi:ReportSequence MessageNumber="11"/>
    </s12:Header>
    <s12:Body>
        <msg:EpisodicMetricReport MdibVersion="..." SequenceId="..." InstanceId="...">
            <!-- ... -->
        </msg:EpisodicMetricReport>
    </s12:Body>
</s12:Envelope>
