asciidoc/listings/vol2-clause-appendix-a-mdpws-dev-29-waveformstream.xml

<?xml version="1.0" encoding="UTF-8"?>
<s12:Envelope
        xmlns:s12="http://www.w3.org/2003/05/soap-envelope"
        xmlns:msg="http://standards.ieee.org/downloads/11073/11073-10207-2017/message"
        xmlns:wsa="http://www.w3.org/2005/08/addressing">
    <s12:Header>
        <wsa:Action>http://standards.ieee.org/downloads/11073/11073-20701-2018/WaveformService/WaveformStream</wsa:Action>
        <wsa:MessageID><!-- ... --></wsa:MessageID>
        <wsa:To><!-- ... --></wsa:To>
    </s12:Header>
    <s12:Body>
        <msg:WaveformStream MdibVersion="..." SequenceId="..." InstanceId="...">
            <!-- ... -->
        </msg:WaveformStream>
    </s12:Body>
</s12:Envelope>
